const posts = [
    {
        id: 1,
        date: '23 Августа 2026',
        title: 'Ядерная зима - печальная история создания',
        shortDesc: 'Что произошло с первыми разработчиками игры и к чему это ведет?',
        fullText: `
            <p>Сегодня вы заглянете в душу к креативному директору <b>Nuclear Winter</b>.</p>
            <p>Сюжет к нашей игре, был придуман двумя школьниками, в 2020 году.</p>
            <p>Александр "Туман" Невский, так звали одного из парней. К сожалению, он погиб в потасовке, что сильно повлияло на развитие данного проекта.</p>
            <p>"У него было не простое детство. Не было родителей, с самого, самого. Его никто не воспитывал. Но он был самым добрым человеком, которого я когда-либо знал. Жаль, что этот проект выйдет без его мнения, но сюжет остался максимально приближенным к изначальному, который придумали мы вместе" - коментарии креативного директора</p>
            <p>Что с проектом сейчас?</p>
            <ul style="margin-left: 20px; margin-bottom: 20px;">
                <li>Полностью завершен сюжет, все арки проработаны, все концовки на уровне концепта готовы.</li>
                <li>Большая часть механик уже работает. Осталось только прикрутить графику и добавить скрипты на сюжет.</li>
                <li>Команда активно работает над 3D и 2D составялющей.</li>
                <li>Трейлер готов примерно на 50%, но скоро работа пойдет быстрее</li>
            </ul>
            <p>Следите за новостями и оставайтесь с нами!</p>
        `
    },
    {
        id: 2,
        date: '13 Сентября 2026',
        title: 'Новый проект - Global Feed',
        shortDesc: 'Новое направление - мессенджер, с глобальной лентой.',
        fullText: `
            <p><b>Global feed</b> это новый вид соц. сети.</p>
            <p>Это не просто мессенджер для общения. Это, как дружная семья, которая делится всем, что происходит в жизни. Другие в свою очередь отвечают за это.</p>
            <p>Сама задумка, объединить людей. Не просто смотреть по интересам и долбить одну позицию, а рассматривать разные мнения.</p>
            <p>помимо глобальной ленты, сам мессенджер защищен E2E шифрованием, что даже мы, не можем прочитать сообщения, которые вы пишите.</p>
            <p>Это прорыв в нашем мире. Следите за разработкой, чтобы узнать больше!</p>
        `
    },
    {
        id: 3,
        date: '19 Октября 2026',
        title: 'Новый проект - Copper Dogs',
        shortDesc: 'Новый проект, который скоро получит активную поддержку до самого выхода.',
        fullText: `
            <p>Мы очень любим бандитскую тематику. Наша студия начала разработку первой игры, именно по бандитской тематике, ещё в далеком 2022 году.</p>
            <p>Мы решили закрыть проект, т.к. этот проект был слишком амбициозен и сложный.</p>
            <p><b>Copper dogs</b> очень интересный проект, для любителей менеджмент-симуляторов.</p>
            <p>Приятная, векторная, мултяшная графика. Тебе приятно играть в эту игру, из-за атмосферы, сюжета и уникальных механик.</p>
            
        `
    }
];
